# 1) შექმენით 5 ელემენტიანი სია და დაბეჭდეთ მისი მე-4 ელემენტი. (any index)
my_list  = [0, 1, 2, 3, 4 ,5]
print(my_list[4])

# 2) შექმენით 5 ელემენტიანი სია, სადაც ჩაწერთ თქვენს საყვარელი მანქანების სახელს. ბოლოს გამოიტანეთ სიაში მყოფი პირველი და მესამე მნიშვნელობა. (დადებითი index-ებით)
my_list2 = ["ford", "dodge", "porche", "tesla"]
print(my_list2[0])
print(my_list2[2])

# 3) შექმენით რიცხვების სია, სადაც ჩაწერთ 0-დან 10-ის ჩათვლით ყველა ლუწ რიცხვს. ბოლოს გამოიტანეთ სიაში მყოფი მეორე და მეოთხე მნიშვნელობა. (აურყოფითი index-ებით)

num_arr = [0, 2, 4, 6, 8,10]

print(num_arr[-4]) 
print(num_arr[-3]) 