# 1) გააკეთეთ თითო მაგალითი თითო მათემატიკურ ოპერატორზე.

# 2) შექმენით 3 ცვლადი -->
# პირველ ცვლადში შეინახეთ ინფორმაცია თქვენი სახელის შესაახებ.

# მეორე ცვლადში შეინახეთ ინფორმაცია თქვენი ასაკის შესახებ.

# მესამე ცვლადში შეინახეთ ინფორმაცია თქვენი საყვარელი ფერის შესახებ.

# main task: ააგეთ ერთი დიდი წინადადება ცვლადების დახმარებით როგორც გაკვეთილზე მაგალითის სახით გავაკეთეთ.

# 1

print(1+2)
print(2-2)
print(3*2)
print(4/2)

#2

name = "mate"
age =  21
color = "black"
  
print(name,age,color)









