# 2) კომენტარებით ახსენით თუ რა არის custom ფუნქციები, რისთვის გამოვიყენებთ და რა დანიშნულება გააჩნიათ, ასევე ახსენით მისი შექმნის გზები ეტაპობრივად და ახსენეთ თუ რაა პარამეტრები და არგუმენტები.

# . 1 ქასთუმ ფუნქცია ადამიანის მიერ შექმნილი კოდის ბლოკია.
#  დანიშნულება: თავიდან აგვაცილოს ერთი და იგივე კოდის ხელახლა წერა.
# 2. შექმნის ეტაპები:
#  1: ვწერთ def -ს და სახელს.
#  2: ვწერთ ფუნქციის სახელს 
#  3: ()-ში ვსვამთ პარამეტრებს (ცვლადებს, რასაც ფუნქცია ელოდება).
#  4: პარეამეტრების შემდეგ ვწერთ : რის ქვეშ ვწერთ ფუნქციის კოდს 

# 3) შექმენით ფუნქცია, რომელსაც გადაეცემა ორი რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ ორი რიცხვის ჯამი.

def sum(a, b):
    return a + b
print(sum(5, 10))

# 4) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა შეამოწმოთ ამ რიცხვის ლუწობა. თუ იგი ლუწია, დაბეჭდეთ "რიცხვი ლუწია" სხვა შემთხვევაში "რიცხვი კენტია"

def check_even_odd(number):
    if number % 2 == 0:
        return "Even"
    else:
        return "Odd"
print(check_even_odd(4))

# 5) შექმენით ფუნქცია, რომელსაც გადაეცემა 1 რიცხვი. თქვენი დავალებაა დააბრუნოთ ამ რიცხვის კვადრატული მნიშნელობა.

def square_number(number):
    return number ** 2 
    
# 6) შექმენით ფუნქცია, რომელიც გადაცემულ ტექსტს აბრუნებს დიდი ასოებით.

def make_uppercase(text):
    return text.upper()

# 7) შექმენით ფუნქცია, რომელსაც პარამეტრებად გადაეცემა სახელი და გვარი, თქვენი დავალებაა გამოიტანოთ მნიშვნელობები ერთი წინადადების სახით.


def greet_person(first_name, last_name):
    print(f"გამარჯობა, {first_name} {last_name}!")
greet_person("გიორგი", "კაპანაძე")