# 2) კომენტარებით ახსენით რა არის სია და როგორ უნდა შევქმნათ ის python-ში.
# სია არის მონაცემთა ტიპი  რომელიც ინახავს მრავალ მნიშვნელობას ერთ ცვლადში.
# სია იქმნება კვადრატული ფრჩხილით  [] და გამიტოვება მძიმით ,

# 3) კომენტარებით ახსენით რა არის index-ი.
# index-ი არის ელემენტის პოზიცის ნომერი სიაში

# 4) შექმენით 7 ელემენტიანი სახელების სია, შეცვალეთ 1-ლი და მე-5 ინდექსზე მდგომი ელემენტების მნიშვნელობა.

fruit_list = ["apple", "banana", "orange", "pear", "cherry", "grape", "mmelon"]

fruit_list[1] = "kiwi"
fruit_list[5] = "plum"
print(fruit_list)

# 5) შექმენით სია და შეიტანეთ შიგნით სხვადასხვა ელემენტები და გამოიტანეთ მე-2 ,მე-4 და მე-6 ელემენტები და ახსენით როგორ გამოგაქვთ.

city_list = ["batumi", "tbilsi", "gori", "svaneti", "kutaisi", "axalcixe"]

city_list[1]
city_list[3]
city_list[5]

# ინდექსები მიუთითებს ელემენტების პოზიციაზე, სიაში ათვლა იწყება ნულიდან ამიტომ მეორე, მეოთხე, მეექვსე ელემენტებისთვის შესაბამისად ვიყენებ 1,3,5 ინდექსებს
print(city_list[1])
print(city_list[3])
print(city_list[5])


# 6) კომენტარებით ახსენით ასევე განსხვავება list-ს და ცვლადს შორის.

# list არის მონაცემთა ტიპი რომელიც ინახავს მრავალ მნიშვნელობას. ცვლადი არის კონტეინერი ერთი კონკრეტული მნიშვნელობისთვის
