# 2) მოცემულია რიცხვების სია. გამოიყენეთ slicing-ის ბიჯი (step), რათა სიიდან ამოიღოთ ყოველი მეორე რიცხვი.
# -- numbers_step = [5, 10, 15, 20, 25, 30, 35, 40] --

num_step = [5, 10,15, 20, 25, 30, 35, 40]
num_step = num_step [::2]
print(num_step)

# 3) მოცემულია ხილის სია. გამოიყენეთ slicing, რათა ამოჭრათ და მიიღოთ მხოლოდ შუაში მყოფი 3 ხილი.
# -- fruits = ["ვაშლი", "მსხალი", "ატამი", "ბალი", "ყურძენი", "ბანანი", "ფორთოხალი"] --

fruits = ["apple", "pear", "peach", "cherry", "grape", "banana", "orange"]
fruits = fruits [2:5]

# 4) მოცემული გაქვთ რიცხვების სია. თქვენი დავალებაა for ციკლისა და if პირობის გამოყენებით სიაში იპოვოთ და დაბეჭდოთ მხოლოდ ლუწი (even) რიცხვები.

# -- mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77] --

mixed_nums = [12, 45, 8, 33, 91, 24, 10, 77]
for num in mixed_nums:
    if num % 2 == 0:  
        print(num)

# 5) კომენტარების დახმარებით ახსენით თუ რა არის ფუნქციები და რა დანიშნულება გააჩნიათ.
# ფუნქცია არის შექმნილი ბრძანება  ფუნქციის მთავარი დანიშნულებაა საქმის გამარტივება და დროის დაზოგვა.

# 6) კომენტარების დახმარებით ახსენით თუ რა არის ფუნქციების არგუმენტები, მოიყვანეთ მაგალითები.

# ფუნქციის არგუმენტი არის ინფორმაცია, რომელსაც ფუნქციას შიგნით აწვდი, რომ იმუშავოს.
print("ანი")
print("სალამი")

# 7) გააკეთეთ მაგალითები .lower() და .upper() ფუნქციებზე.

name1 = "giorgi"
name2 = "NINO"
print(name1.upper())  
print(name2.lower())  

