# 1) კომენტარების სახით ახსენით თუ რას აკეთებს .upper(), .lower() ფუნქციები.
# upper ფუნქციას შეუძლია გამოიტანოს მონაცემი დიდი ასოებით
# lower ფუნქციას შეუძლია გამოიტანოს მონაცემი პატარა ასოებით


# 2) მომხმარებელს შემოატანინეთ თავისი სახელი. თქვენი დავალებაა მომხმარებელს ეს სახელი დაუბეჭდოთ მაღალ (upper) და დაბალ (lower) რეგისტრებში.


name = input("Please enter your name: ")
print("Uppercase:", name.upper())
print("Lowercase:", name.lower())

# 3) მოცემულია რიცხვების სია. გამოიყენეთ slicing, რომ ამოიღოთ სიიდან ყოველი მეორე რიცხვი.
# numbers = [10, 20, 30, 40, 50, 60, 70] 

numbers = [10, 20, 30, 40, 50, 60, 70]
result = numbers[::2]
print(result)